app/controllers/main_controller.rb

  def index
    @posts = Post.find(:all, :conditions => { :published => true }, :order => :created_at)
---
SELECT * FROM "posts" WHERE ("posts"."published" = 't') ORDER BY created_at