app/controllers/posts_controller.rb

  def edit
    @post = Post.find(params[:id])
    @temp_post = TempPost.new(
      "title" => @post.title,
      "body" => @post.body,
      "post_id" => @post.id
      )
    if @temp_post.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "temp_posts" ("created_at", "title", "body", "updated_at", "original_post_id") VALUES('2009-01-07 18:40:18', 'First!', 'Testing 123.', '2009-01-07 18:40:18', 1)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "body", "published", "updated_at", "section_id") VALUES('2008-12-09 23:17:52', 'Tester posty thingy', 'I''m seeing if the published status changes when it should.', 'f', '2008-12-09 23:17:52', NULL)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "updated_at" = '2009-01-07 17:55:26', "body" = 'La la la. Weeee!' WHERE "id" = 5

  def publish
    @post = Post.find(params[:id])
    @post.published = true
    if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 3)
UPDATE "posts" SET "updated_at" = '2008-12-09 23:19:18', "published" = 't' WHERE "id" = 3

  def revert
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 5)

  def save_temp
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 5)