app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[:id])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 1)