app/controllers/temp_posts_controller.rb

SELECT * FROM "temp_posts" WHERE ("temp_posts"."id" = 2)
---
  def edit
    @temp = TempPost.find(params[:id])

SELECT * FROM "temp_posts" WHERE ("temp_posts"."id" = 2)
UPDATE "temp_posts" SET "updated_at" = '2009-01-07 18:52:10', "body" = 'Testing 123. Antoehr change' WHERE "id" = 2
---
  def update
    @temp = TempPost.find(params[:id])

    respond_to do |format|
      if @temp.update_attributes(params[:temp_post])

SELECT * FROM "temp_posts" WHERE ("temp_posts"."id" = 2)
DELETE FROM "temp_posts" WHERE "id" = 2
---
  def revert
    @temp = TempPost.find(params[:id])
    @post = Post.find(:first, :conditions => ["id = ?", @temp.post_id])
    @temp.destroy